```terraform
[command]/home/runner/work/_temp/3e56356a-481a-469c-9ee3-810e6055f816/terraform-bin plan -out=environment.tfplan -no-color
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]
module.s3.aws_s3_bucket.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.route53[0].data.aws_route53_zone.main: Reading...
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]
module.vpc.data.aws_vpc.default: Reading...
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.route53[0].data.aws_route53_zone.main: Read complete after 1s [id=Z0419438LZ88EPNOCFMA]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 1s [id=lambda_role]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.s3.aws_s3_bucket_public_access_block.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.s3.aws_s3_bucket_cors_configuration.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.s3.aws_s3_bucket_policy.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]
module.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]
module.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.dynamodb.aws_dynamodb_table.company will be destroyed
  # (because aws_dynamodb_table.company is not in configuration)
  - resource "aws_dynamodb_table" "company" {
      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "company_id" -> null
      - id                          = "staging-Company" -> null
      - name                        = "staging-Company" -> null
      - read_capacity               = 1 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "company_id" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "email" -> null
          - type = "S" -> null
        }

      - global_secondary_index {
          - hash_key           = "email" -> null
          - name               = "EmailIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 10 -> null
          - write_capacity     = 10 -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.dynamodb.aws_dynamodb_table.criterion will be destroyed
  # (because aws_dynamodb_table.criterion is not in configuration)
  - resource "aws_dynamodb_table" "criterion" {
      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "id" -> null
      - id                          = "staging-Criterion" -> null
      - name                        = "staging-Criterion" -> null
      - read_capacity               = 1 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "checklist_id" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - global_secondary_index {
          - hash_key           = "checklist_id" -> null
          - name               = "ChecklistIdIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 10 -> null
          - write_capacity     = 10 -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.dynamodb.aws_dynamodb_table.interview_access_token will be updated in-place
  ~ resource "aws_dynamodb_table" "interview_access_token" {
        id                          = "staging-InterviewAccessToken"
        name                        = "staging-InterviewAccessToken"
        tags                        = {}
        # (9 unchanged attributes hidden)

      + attribute {
          + name = "candidate_id"
          + type = "S"
        }
      + attribute {
          + name = "interview_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "candidate_id"
          + name               = "CandidateInterviewIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "interview_id"
          + read_capacity      = 10
          + write_capacity     = 10
        }

        # (3 unchanged blocks hidden)
    }

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-26-18-56-47" -> (known after apply)
        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "staging-dynamodb"
        }
      + tags_all              = {
          + "Name" = "staging-dynamodb"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0a2c6ea576ea1c2a5"
    }

  # module.vpc.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "staging-s3"
        }
      + tags_all              = {
          + "Name" = "staging-s3"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0a2c6ea576ea1c2a5"
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]%0Amodule.s3.aws_s3_bucket.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.route53[0].data.aws_route53_zone.main: Reading...%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]%0Adata.aws_ssm_parameter.route53_hosted_zone: Reading...%0Amodule.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Adata.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=791901361445]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Adata.aws_ssm_parameter.route53_zone_id: Reading...%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.route53[0].data.aws_route53_zone.main: Read complete after 1s [id=Z0419438LZ88EPNOCFMA]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]%0Adata.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 1s [id=lambda_role]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Aaws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.s3.aws_s3_bucket_public_access_block.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.s3.aws_s3_bucket_cors_configuration.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.s3.aws_s3_bucket_policy.data_question_response_video: Refreshing state... [id=staging-data-question-response-video]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]%0Amodule.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]%0Amodule.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]%0Amodule.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]%0Amodule.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]%0Amodule.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]%0Amodule.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]%0Amodule.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]%0Amodule.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]%0Amodule.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]%0Amodule.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]%0Amodule.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]%0Amodule.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]%0Amodule.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]%0Amodule.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]%0Amodule.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]%0Amodule.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]%0Amodule.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]%0Amodule.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]%0Amodule.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]%0Amodule.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]%0Amodule.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]%0Amodule.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]%0Amodule.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]%0Amodule.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]%0Amodule.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]%0Amodule.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.dynamodb.aws_dynamodb_table.company will be destroyed%0A  # (because aws_dynamodb_table.company is not in configuration)%0A  - resource "aws_dynamodb_table" "company" {%0A      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company" -> null%0A      - billing_mode                = "PROVISIONED" -> null%0A      - deletion_protection_enabled = false -> null%0A      - hash_key                    = "company_id" -> null%0A      - id                          = "staging-Company" -> null%0A      - name                        = "staging-Company" -> null%0A      - read_capacity               = 1 -> null%0A      - stream_enabled              = false -> null%0A      - table_class                 = "STANDARD" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A      - write_capacity              = 1 -> null%0A%0A      - attribute {%0A          - name = "company_id" -> null%0A          - type = "S" -> null%0A        }%0A      - attribute {%0A          - name = "email" -> null%0A          - type = "S" -> null%0A        }%0A%0A      - global_secondary_index {%0A          - hash_key           = "email" -> null%0A          - name               = "EmailIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 10 -> null%0A          - write_capacity     = 10 -> null%0A        }%0A%0A      - point_in_time_recovery {%0A          - enabled = false -> null%0A        }%0A%0A      - ttl {%0A          - enabled = false -> null%0A        }%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.criterion will be destroyed%0A  # (because aws_dynamodb_table.criterion is not in configuration)%0A  - resource "aws_dynamodb_table" "criterion" {%0A      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion" -> null%0A      - billing_mode                = "PROVISIONED" -> null%0A      - deletion_protection_enabled = false -> null%0A      - hash_key                    = "id" -> null%0A      - id                          = "staging-Criterion" -> null%0A      - name                        = "staging-Criterion" -> null%0A      - read_capacity               = 1 -> null%0A      - stream_enabled              = false -> null%0A      - table_class                 = "STANDARD" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A      - write_capacity              = 1 -> null%0A%0A      - attribute {%0A          - name = "checklist_id" -> null%0A          - type = "S" -> null%0A        }%0A      - attribute {%0A          - name = "id" -> null%0A          - type = "S" -> null%0A        }%0A%0A      - global_secondary_index {%0A          - hash_key           = "checklist_id" -> null%0A          - name               = "ChecklistIdIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 10 -> null%0A          - write_capacity     = 10 -> null%0A        }%0A%0A      - point_in_time_recovery {%0A          - enabled = false -> null%0A        }%0A%0A      - ttl {%0A          - enabled = false -> null%0A        }%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.interview_access_token will be updated in-place%0A  ~ resource "aws_dynamodb_table" "interview_access_token" {%0A        id                          = "staging-InterviewAccessToken"%0A        name                        = "staging-InterviewAccessToken"%0A        tags                        = {}%0A        # (9 unchanged attributes hidden)%0A%0A      + attribute {%0A          + name = "candidate_id"%0A          + type = "S"%0A        }%0A      + attribute {%0A          + name = "interview_id"%0A          + type = "S"%0A        }%0A%0A      + global_secondary_index {%0A          + hash_key           = "candidate_id"%0A          + name               = "CandidateInterviewIndex"%0A          + non_key_attributes = []%0A          + projection_type    = "ALL"%0A          + range_key          = "interview_id"%0A          + read_capacity      = 10%0A          + write_capacity     = 10%0A        }%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.rds.aws_db_instance.secure[0] will be updated in-place%0A  ~ resource "aws_db_instance" "secure" {%0A      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-26-18-56-47" -> (known after apply)%0A        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"%0A        tags                                  = {}%0A        # (52 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.dynamodb will be created%0A  + resource "aws_vpc_endpoint" "dynamodb" {%0A      + arn                   = (known after apply)%0A      + cidr_blocks           = (known after apply)%0A      + dns_entry             = (known after apply)%0A      + id                    = (known after apply)%0A      + ip_address_type       = (known after apply)%0A      + network_interface_ids = (known after apply)%0A      + owner_id              = (known after apply)%0A      + policy                = (known after apply)%0A      + prefix_list_id        = (known after apply)%0A      + private_dns_enabled   = false%0A      + requester_managed     = (known after apply)%0A      + route_table_ids       = (known after apply)%0A      + security_group_ids    = (known after apply)%0A      + service_name          = "com.amazonaws.us-east-1.dynamodb"%0A      + state                 = (known after apply)%0A      + subnet_ids            = (known after apply)%0A      + tags                  = {%0A          + "Name" = "staging-dynamodb"%0A        }%0A      + tags_all              = {%0A          + "Name" = "staging-dynamodb"%0A        }%0A      + vpc_endpoint_type     = "Gateway"%0A      + vpc_id                = "vpc-0a2c6ea576ea1c2a5"%0A    }%0A%0A  # module.vpc.aws_vpc_endpoint.s3 will be created%0A  + resource "aws_vpc_endpoint" "s3" {%0A      + arn                   = (known after apply)%0A      + cidr_blocks           = (known after apply)%0A      + dns_entry             = (known after apply)%0A      + id                    = (known after apply)%0A      + ip_address_type       = (known after apply)%0A      + network_interface_ids = (known after apply)%0A      + owner_id              = (known after apply)%0A      + policy                = (known after apply)%0A      + prefix_list_id        = (known after apply)%0A      + private_dns_enabled   = false%0A      + requester_managed     = (known after apply)%0A      + route_table_ids       = (known after apply)%0A      + security_group_ids    = (known after apply)%0A      + service_name          = "com.amazonaws.us-east-1.s3"%0A      + state                 = (known after apply)%0A      + subnet_ids            = (known after apply)%0A      + tags                  = {%0A          + "Name" = "staging-s3"%0A        }%0A      + tags_all              = {%0A          + "Name" = "staging-s3"%0A        }%0A      + vpc_endpoint_type     = "Gateway"%0A      + vpc_id                = "vpc-0a2c6ea576ea1c2a5"%0A    }%0A%0APlan: 2 to add, 2 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: environment.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "environment.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```